Refactor repository structure and streamline project documentation
Feat/restructure repo
